read_verilog ../src/ALU.v
synth -top ALU
show
write_verilog ALU_netlist.v
